#+TITLE:     Flatpak
#+AUTHOR:    David Conner
#+EMAIL:     noreply@te.xel.io
#+DESCRIPTION: notes

* Tasks

*** TODO update XDG =~/Documents=, etc locations (should already be done)

* Overview

This file describes most of the setup, which may require some steps
in [[file:Bash.org::*Flatpak][Bash.org: Flatpak]] to complete. e.g.

+ prepend =/flatpak= to =XDG_DATA_DIRS=
+ create link from =/data/flatpak= to =/flatpak=

** Environment

Quick reminder of the environment before proceeding

#+begin_src emacs-lisp :results output
(let* ((+-env-vars '("_DF" "_DATA" "_XS" "_ECTO" "_REPO" "_STEAM" "_FLATPAK" "_FLATPAK_NAME" "DOOMDIR" "_GUIX"))
       (+-env-alist (->> +-env-vars
                         (--annotate (getenv it))
                         (--> (-lambda (a) (rassoc it))))))
  (--each +-env-alist (print it)))
#+end_src

#+RESULTS:
#+begin_example

("/home/dc/.dotfiles" . "_DF")

("/data" . "_DATA")

("/data" . "_XS")

("/data/ecto" . "_ECTO")

("/data/repo" . "_REPO")

("/steam" . "_STEAM")

("/flatpak" . "_FLATPAK")

("flexpak" . "_FLATPAK_NAME")

("/home/dc/.doom.d" . "DOOMDIR")

("/gnu" . "_GUIX")
#+end_example


* Channel

This requires having a custom channel and creating a packge which inherits.

+ Config lives in the =./etc= directory of the installed packages
  -  [[file:/gnu/store/hnwpzwshaq2nfvmdvlsg2fcp8b45c4hg-flatpak-1.12.3][file:/gnu/store/hnwpzwshaq2nfvmdvlsg2fcp8b45c4hg-flatpak-1.12.3]]

+ Need to apply the custom =flexpak.conf= configuration to a custom package
  - find the source [[file:/data/ecto/guix/guix/gnu/packages/package-management.scm][here]] in =(gnu packages package-management)= module

* Manifest

#+begin_src scheme :tangle .config/guix/manifests/flexpak.scm
(specifications->manifest
 "flatpak"
  "xdg-desktop-portal-gtk"
    )
#+end_src

* System Setup

The installation endpoint (i.e. =$_FLATPAK=) should have already been created

** Installation ([[\[Installation "extra"\]][docs]])

Ensure the configuration directory exists

#+begin_src shell

sudo mkdir -p /etc/flatpak/installations.d/

#+end_src

Create the flatpak configuration

#+begin_example org
#+begin_src conf :tangle /sudo:root@localhost:/etc/flatpak/installations.d/flexpak.conf

[Installation "flexpak"]
Path=/flatpak
DisplayName=Flexpak
StorageType=harddisk

#+end_src
#+end_example

** Repos

Set up the remotes for the flatpak install

#+begin_src shell

flatpak remote-add --installation=$_FLATPAK_NAME --if-not-exists flathub https://flathub.org/repo/flathub.flatpakrepo
flatpak remote-add --installation=$_FLATPAK_NAME --if-not-exists flathub-beta https://flathub.org/beta-repo/flathub-beta.flatpakrepo

#+end_src

#+RESULTS:

** Applications

*Applications to Install*

#+begin_src shell

case $(hostname) in

    hersai)

        flatpak install --installation=$_FLATPAK_NAME flathub com.discordapp.Discord
        flatpak install --installation=$_FLATPAK_NAME flathub-beta com.obsproject.Studio
        flatpak install --installation=$_FLATPAK_NAME flathub us.zoom.Zoom
        flatpak install --installation=$_FLATPAK_NAME flathub org.blender.Blender

        flatpak install --installation=$_FLATPAK_NAME flathub org.gustavoperedo.FontDownloader
esac

        #flatpak install --user flathub com.valvesoftware.Steam
        #flatpak install --user flathub com.valvesoftware.Steam.CompatibilityTool.Proton
        #flatpak install --installation=$_FLATPAK_NAME flathub net.ankiweb.Anki

#+end_src

*** Until the custom flatpak installation is setup

#+begin_src shell

flatpak --user flathub com.discordapp.Discord
flatpak --user flathub-beta com.obsproject.Studio
flatpak --user flathub us.zoom.Zoom
flatpak --user flathub org.blender.Blender
flatpak --user flathub net.ankiweb.Anki

#+end_src
